The diff from `terraform plan` is very large but doesn't look too bad to me – I think it's being overly verbose when bits of the CloudFront get shuffled.

The code changes look fine. Do you want me to apply this?

<details>

```
Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_function.dlcs_path_rewrite will be updated in-place
  ~ resource "aws_lambda_function" "dlcs_path_rewrite" {
        id                             = "cf_edge_dlcs_path_rewrite"
      ~ last_modified                  = "2023-05-05T14:13:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> (known after apply)
      ~ s3_object_version              = "9bI_zevWmFRgz2Fb1s.rGO7oYhj70NH4" -> "TaXBqEjhOMRUJDINFVPrsb1MZFo9v1p0"
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cert_stagenew.aws_acm_certificate.cert will be destroyed
  # (because aws_acm_certificate.cert is not in configuration)
  - resource "aws_acm_certificate" "cert" {
      - arn                       = "arn:aws:acm:us-east-1:760097843905:certificate/b4f4f15c-ff39-4965-b022-d61d972b46ff" -> null
      - domain_name               = "iiif-stage-new.wellcomecollection.org" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "iiif-stage-new.wellcomecollection.org"
              - resource_record_name  = "_9b2cf9ab2b7512b1c374c0f247189c9f.iiif-stage-new.wellcomecollection.org."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_87885364f837002e1cb2d17991acf866.hsmgrxbjqd.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:760097843905:certificate/b4f4f15c-ff39-4965-b022-d61d972b46ff" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.cert_stagenew.aws_acm_certificate_validation.validation will be destroyed
  # (because aws_acm_certificate_validation.validation is not in configuration)
  - resource "aws_acm_certificate_validation" "validation" {
      - certificate_arn         = "arn:aws:acm:us-east-1:760097843905:certificate/b4f4f15c-ff39-4965-b022-d61d972b46ff" -> null
      - id                      = "2023-01-18 16:24:01.587 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_9b2cf9ab2b7512b1c374c0f247189c9f.iiif-stage-new.wellcomecollection.org",
        ] -> null
    }

  # module.cert_stagenew.aws_route53_record.cert_validation["iiif-stage-new.wellcomecollection.org"] will be destroyed
  # (because aws_route53_record.cert_validation is not in configuration)
  - resource "aws_route53_record" "cert_validation" {
      - fqdn    = "_9b2cf9ab2b7512b1c374c0f247189c9f.iiif-stage-new.wellcomecollection.org" -> null
      - id      = "Z0902614YH73JBCZG1MA__9b2cf9ab2b7512b1c374c0f247189c9f.iiif-stage-new.wellcomecollection.org_CNAME" -> null
      - name    = "_9b2cf9ab2b7512b1c374c0f247189c9f.iiif-stage-new.wellcomecollection.org" -> null
      - records = [
          - "_87885364f837002e1cb2d17991acf866.hsmgrxbjqd.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z0902614YH73JBCZG1MA" -> null
    }

  # module.iiif-stage.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                             = "E1ADWCLNPHV609"
        tags                           = {
            "Managed" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # module.iiif-stage-new.aws_cloudfront_distribution.iiif will be destroyed
  # (because aws_cloudfront_distribution.iiif is not in configuration)
  - resource "aws_cloudfront_distribution" "iiif" {
      - aliases                        = [
          - "iiif-stage-new.wellcomecollection.org",
        ] -> null
      - arn                            = "arn:aws:cloudfront::760097843905:distribution/E1H35XDXDHYD5" -> null
      - caller_reference               = "terraform-20230119090956813000000001" -> null
      - comment                        = "IIIF APIs (stage-new)" -> null
      - domain_name                    = "dlwv244u8ijgv.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E3PIHJJRSXQGBR" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E1H35XDXDHYD5" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = true -> null
      - last_modified_time             = "2023-01-19 09:09:58.206 +0000 UTC" -> null
      - price_class                    = "PriceClass_100" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {
          - "Managed" = "terraform"
        } -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 3600 -> null
          - max_ttl                = 86400 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "iiif" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Origin",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/A00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/B00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/L00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/M00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/N00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/S00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/V00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "image/W00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 604800 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 86400 -> null
          - path_pattern           = "image/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_images" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/A00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/B00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/L00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/M00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/N00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/S00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/V00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/W00*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_wellcome_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumb/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "iiif" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "*",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "thumbs/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_thumbs" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "av/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_av" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "pdf/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_pdf" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "file/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_file" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "auth/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dlcs_auth" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "dash/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "dashboard" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "*",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }
      - ordered_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - path_pattern           = "pdf-cover/*" -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "pdf_cover" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_auth" -> null
          - origin_path = "/auth/2" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-stage-new.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_av" -> null
          - origin_path = "/iiif-av/wellcome/6" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-stage-new.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_images" -> null
          - origin_path = "/iiif-img/wellcome/6" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-stage-new.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_thumbs" -> null
          - origin_path = "/thumbs/wellcome/6" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-stage-new.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_wellcome_images" -> null
          - origin_path = "/iiif-img/wellcome/8" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-stage-new.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_wellcome_thumbs" -> null
          - origin_path = "/thumbs/wellcome/8" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-stage-new.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "dash-stage-new.wellcomecollection.digirati.io" -> null
          - origin_id   = "dashboard" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "dds-stage-new.wellcomecollection.digirati.io" -> null
          - origin_id   = "iiif" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_file" -> null
          - origin_path = "/file/wellcome/6" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_pdf" -> null
          - origin_path = "/pdf/wellcome/pdf/6" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "pdf-stage-new.wellcomecollection.digirati.io" -> null
          - origin_id   = "pdf_cover" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:760097843905:certificate/b4f4f15c-ff39-4965-b022-d61d972b46ff" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.iiif-stage-new.aws_route53_record.subdomain will be destroyed
  # (because aws_route53_record.subdomain is not in configuration)
  - resource "aws_route53_record" "subdomain" {
      - fqdn    = "iiif-stage-new.wellcomecollection.org" -> null
      - id      = "Z0902614YH73JBCZG1MA_iiif-stage-new.wellcomecollection.org_CNAME" -> null
      - name    = "iiif-stage-new.wellcomecollection.org" -> null
      - records = [
          - "dlwv244u8ijgv.cloudfront.net",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z0902614YH73JBCZG1MA" -> null
    }

  # module.iiif-test.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                             = "E2RTRZI6TQCGOR"
        tags                           = {
            "Managed" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }

      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_auth"
          + origin_path = "/auth/2"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-test.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_av"
          + origin_path = "/iiif-av/wellcome/9"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-test.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_images"
          + origin_path = "/iiif-img/wellcome/9"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-test.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_thumbs"
          + origin_path = "/thumbs/wellcome/9"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-test.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_wellcome_images"
          + origin_path = "/iiif-img/wellcome/8"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-test.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_wellcome_thumbs"
          + origin_path = "/thumbs/wellcome/8"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-test.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_auth" -> null
          - origin_path = "/auth/2" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-test.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_av" -> null
          - origin_path = "/iiif-av/wellcome/5" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-test.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_images" -> null
          - origin_path = "/iiif-img/wellcome/5" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-test.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_thumbs" -> null
          - origin_path = "/thumbs/wellcome/5" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-test.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_wellcome_images" -> null
          - origin_path = "/iiif-img/wellcome/8" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-test.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_wellcome_thumbs" -> null
          - origin_path = "/thumbs/wellcome/8" -> null

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif-test.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "dash-test.wellcomecollection.digirati.io" -> null
          - origin_id   = "dashboard" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + domain_name = "dash-test.wellcomecollection.digirati.io"
          + origin_id   = "dashboard"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      - origin {
          - domain_name = "dds-test.wellcomecollection.digirati.io" -> null
          - origin_id   = "iiif" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + domain_name = "dds-test.wellcomecollection.digirati.io"
          + origin_id   = "iiif"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_file"
          + origin_path = "/file/wellcome/9"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_pdf"
          + origin_path = "/pdf/wellcome/pdf/9"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_file" -> null
          - origin_path = "/file/wellcome/5" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "neworchestrator.dlcs.io" -> null
          - origin_id   = "dlcs_pdf" -> null
          - origin_path = "/pdf/wellcome/pdf/5" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - domain_name = "pdf-stage.wellcomecollection.digirati.io" -> null
          - origin_id   = "pdf_cover" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + domain_name = "pdf-stage.wellcomecollection.digirati.io"
          + origin_id   = "pdf_cover"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

        # (6 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 5 to destroy.

Changes to Outputs:
  ~ dlcs_path_rewrite_arn_latest   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> (known after apply)
  - iiif_stage_new_distribution_id = "E1H35XDXDHYD5" -> null
```
</details>